package core

// TColor представляет собой строковый код ANSI-последовательности для управления цветом.
type TColor string

const (
	// =========================================================================
	// СБРОС СТИЛЕЙ (ОБЯЗАТЕЛЕН в конце строки, иначе покрасится весь терминал)
	// =========================================================================

	// TColorReset — Сбросить все цвета и текстовые стили к стандартным
	TColorReset TColor = "\x1b[0m"

	// =========================================================================
	// СТАНДАРТНЫЙ ЦВЕТ ТЕКСТА (30-37)
	// =========================================================================

	TColorBlack   TColor = "\x1b[30m" // Черный
	TColorRed     TColor = "\x1b[31m" // Красный
	TColorGreen   TColor = "\x1b[32m" // Зеленый
	TColorYellow  TColor = "\x1b[33m" // Желтый
	TColorBlue    TColor = "\x1b[34m" // Синий
	TColorMagenta TColor = "\x1b[35m" // Пурпурный
	TColorCyan    TColor = "\x1b[36m" // Голубой
	TColorWhite   TColor = "\x1b[37m" // Белый

	// =========================================================================
	// ЯРКИЙ ЦВЕТ ТЕКСТА (90-97)
	// =========================================================================

	TColorBrightBlack   TColor = "\x1b[90m" // Темно-серый
	TColorBrightRed     TColor = "\x1b[91m" // Светло-красный
	TColorBrightGreen   TColor = "\x1b[92m" // Светло-зеленый
	TColorBrightYellow  TColor = "\x1b[93m" // Светло-желтый
	TColorBrightBlue    TColor = "\x1b[94m" // Светло-синий
	TColorBrightMagenta TColor = "\x1b[95m" // Светло-пурпурный
	TColorBrightCyan    TColor = "\x1b[96m" // Светло-голубой
	TColorBrightWhite   TColor = "\x1b[97m" // Насыщенный белый

	// =========================================================================
	// ЦВЕТ ФОНА (BACKGROUND) (40-47)
	// =========================================================================

	TBgBlack   TColor = "\x1b[40m" // Черный фон
	TBgRed     TColor = "\x1b[41m" // Красный фон
	TBgGreen   TColor = "\x1b[42m" // Зеленый фон
	TBgYellow  TColor = "\x1b[43m" // Желтый фон
	TBgBlue    TColor = "\x1b[44m" // Синий фон
	TBgMagenta TColor = "\x1b[45m" // Пурпурный фон
	TBgCyan    TColor = "\x1b[46m" // Голубой фон
	TBgWhite   TColor = "\x1b[47m" // Белый фон

	// =========================================================================
	// СТИЛИ ТЕКСТА
	// =========================================================================

	TStyleBold      TColor = "\x1b[1m" // Жирный текст
	TStyleUnderline TColor = "\x1b[4m" // Подчеркнутый текст
)
